Revit 2024 API
NavisworksExportOptions.ExportLinks Property
 True to export Revit links found in the main model, false to skip links. Default value is false.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool ExportLinks { get; set; }
Visual Basic
Public Property ExportLinks As Boolean
	Get
	Set
Visual C++
public:
property bool ExportLinks {
	bool get ();
	void set (bool value);
}
See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace